src/InformationRegisters/wsОбработки/wsОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>wsОбработки</name>
  <resources>
    <name>ИмяОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отладка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КаталогОтладки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ХранилищеОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>CatalogRef.wsТипыСообщений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/wsОбработки/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ПодключитьООбработку(Команда)
    Оповещение = Новый ОписаниеОповещения("ПодключитьЗавершение", ЭтотОбъект);
    НачатьПомещениеФайла(Оповещение, , , Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
    Если НЕ Результат Тогда
        Возврат;
    КонецЕсли;
    АдресФайла = Адрес;
    Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
        ТекущийОбъект.ХранилищеОбработки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОбработку(Команда)
	Режим = РежимДиалогаВыбораФайла.Сохранение;
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);
	Фильтр = "Обработка(*.epf)|*.epf";
	ДиалогСохраненияФайла.Фильтр = Фильтр;
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок = "Выберите файл для сохранения";
	ДиалогСохраненияФайла.Показать(Новый ОписаниеОповещения("СохранитьФайлЗавершение", ЭтаФорма, Новый Структура("ДиалогСохраненияФайла", ДиалогСохраненияФайла)));
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	ДиалогСохраненияФайла = ДополнительныеПараметры.ДиалогСохраненияФайла;
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		АдресВоВременномХранилище = ПоместитьВоВременноеХранилищеНаСервере(Запись.ТипСообщения);
		Если Не АдресВоВременномХранилище = Неопределено Тогда
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
			ДвоичныеДанные.Записать(ДиалогСохраненияФайла.ПолноеИмяФайла);
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере(ТипСообщения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	wsОбработки.ХранилищеОбработки КАК ХранилищеОбработки
		|ИЗ
		|	РегистрСведений.wsОбработки КАК wsОбработки
		|ГДЕ
		|	wsОбработки.ТипСообщения = &ТипСообщения";
	
	Запрос.УстановитьПараметр("ТипСообщения", ТипСообщения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	ДвоичныеДанные = ВыборкаДетальныеЗаписи.ХранилищеОбработки.Получить();
	
	АдресПомещения = Новый УникальныйИдентификатор;
	Возврат ПоместитьВоВременноеХранилище(ДвоичныеДанные, АдресПомещения);
	
КонецФункции
